RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Source/gd32e50x_can.c
/*!
    \file    gd32e50x_can.c
    \brief   CAN driver

    \version 2023-12-31, V1.4.0, firmware for GD32E50x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32e50x_can.h"
#include <stdlib.h>

#define CAN_ERROR_HANDLE(s)     do{}while(1)

/* This table can be used to calculate data length in FD mode */
const uint8_t g_can_fdlength_table[] = {12, 16, 20, 24, 32, 48, 64};

/*!
    \brief      deinitialize CAN
    \param[in]  can_periph
    \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[out] none
    \retval     none
*/
void can_deinit(uint32_t can_periph)
{
#if defined(GD32E50X_CL) || defined(GD32E508)
    switch(can_periph)
    {
    case CAN0:
        rcu_periph_reset_enable(RCU_CAN0RST);
        rcu_periph_reset_disable(RCU_CAN0RST);
        break;
    case CAN1:
        rcu_periph_reset_enable(RCU_CAN1RST);
        rcu_periph_reset_disable(RCU_CAN1RST);
        break;
    case CAN2:
        rcu_periph_reset_enable(RCU_CAN2RST);
        rcu_periph_reset_disable(RCU_CAN2RST);
        break;
    default:
        break;
    }
#else
    switch(can_periph)
    {
    case CAN0:
        rcu_periph_reset_enable(RCU_CAN0RST);
        rcu_periph_reset_disable(RCU_CAN0RST);
        break;
    case CAN1:
        rcu_periph_reset_enable(RCU_CAN1RST);
        rcu_periph_reset_disable(RCU_CAN1RST);
        break;
    default:
        break;
    }
#endif
}

/*!
    \brief      initialize CAN parameter struct
    \param[in]  type: the type of CAN parameter struct
                only one parameter can be selected which is shown as below:
      \arg        CAN_INIT_STRUCT: the CAN initial struct
      \arg        CAN_FILTER_STRUCT: the CAN filter struct
      \arg        CAN_FD_FRAME_STRUCT: the CAN FD initial struct
      \arg        CAN_TX_MESSAGE_STRUCT: the CAN TX message struct
      \arg        CAN_RX_MESSAGE_STRUCT: the CAN RX message struct
    \param[in]  p_struct: the pointer of the specific struct
    \param[out] none
    \retval     none
*/
void can_struct_para_init(can_struct_type_enum type, void *p_struct)
{
    uint8_t i;

    if(NULL == p_struct)
    {
        CAN_ERROR_HANDLE("struct parameter can not be NULL \r\n");
    }
    /* get type of the struct */
    switch(type)
    {
    /* used for can_init() */
    case CAN_INIT_STRUCT:
        ((can_parameter_struct *)p_struct)->auto_bus_off_recovery = DISABLE;
        ((can_parameter_struct *)p_struct)->auto_retrans = DISABLE;
        ((can_parameter_struct *)p_struct)->auto_wake_up = DISABLE;
        ((can_parameter_struct *)p_struct)->prescaler = 0x0400U;
        ((can_parameter_struct *)p_struct)->rec_fifo_overwrite = DISABLE;
        ((can_parameter_struct *)p_struct)->resync_jump_width = CAN_BT_SJW_1TQ;
        ((can_parameter_struct *)p_struct)->time_segment_1 = CAN_BT_BS1_3TQ;
        ((can_parameter_struct *)p_struct)->time_segment_2 = CAN_BT_BS2_1TQ;
        ((can_parameter_struct *)p_struct)->time_triggered = DISABLE;
        ((can_parameter_struct *)p_struct)->trans_fifo_order = DISABLE;
        ((can_parameter_struct *)p_struct)->working_mode = CAN_NORMAL_MODE;
        break;
    /* used for can_filter_init() */
    case CAN_FILTER_STRUCT:
        ((can_filter_parameter_struct *)p_struct)->filter_bits = CAN_FILTERBITS_32BIT;
        ((can_filter_parameter_struct *)p_struct)->filter_enable = DISABLE;
        ((can_filter_parameter_struct *)p_struct)->filter_fifo_number = CAN_FIFO0;
        ((can_filter_parameter_struct *)p_struct)->filter_list_high = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_list_low = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_mask_high = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_mask_low = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_mode = CAN_FILTERMODE_MASK;
        ((can_filter_parameter_struct *)p_struct)->filter_number = 0U;
        break;
#ifdef GD32E508
    /* used for can_fd_init() */
    case CAN_FD_FRAME_STRUCT:
        ((can_fdframe_struct *)p_struct)->data_prescaler = 0x0400U;
        ((can_fdframe_struct *)p_struct)->data_resync_jump_width = 1U - 1U;
        ((can_fdframe_struct *)p_struct)->data_time_segment_1 = 3U - 1U;
        ((can_fdframe_struct *)p_struct)->data_time_segment_2 = 2U - 1U;
        ((can_fdframe_struct *)p_struct)->delay_compensation = DISABLE;
        ((can_fdframe_struct *)p_struct)->esi_mode = CAN_ESIMOD_HARDWARE;
        ((can_fdframe_struct *)p_struct)->excp_event_detect = ENABLE;
        ((can_fdframe_struct *)p_struct)->fd_frame = DISABLE;
        ((can_fdframe_struct *)p_struct)->iso_bosch = CAN_FDMOD_ISO;
        ((can_fdframe_struct *)p_struct)->p_delay_compensation = 0U;
        break;
    /* used for can_message_transmit() */
    case CAN_TX_MESSAGE_STRUCT:
        ((can_trasnmit_message_struct *)p_struct)->fd_brs = CAN_BRS_DISABLE;
        ((can_trasnmit_message_struct *)p_struct)->fd_esi = CAN_ESI_DOMINANT;
        ((can_trasnmit_message_struct *)p_struct)->fd_flag = CAN_FDF_CLASSIC;

