RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Source/gd32e50x_can.c
    can_filter_init(can_periph, &can_filter);
}

/*!
    \brief      CAN communication mode configure
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[in]  mode: communication mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_NORMAL_MODE
      \arg        CAN_LOOPBACK_MODE
      \arg        CAN_SILENT_MODE
      \arg        CAN_SILENT_LOOPBACK_MODE
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_monitor_mode_set(uint32_t can_periph, uint8_t mode)
{
    ErrStatus reval = SUCCESS;
    uint32_t timeout = CAN_TIMEOUT;

    if(mode == (mode & CAN_SILENT_LOOPBACK_MODE))
    {
        /* disable sleep mode */
        CAN_CTL(can_periph) &= (~(uint32_t)CAN_CTL_SLPWMOD);
        /* set initialize mode */
        CAN_CTL(can_periph) |= (uint8_t)CAN_CTL_IWMOD;
        /* wait the acknowledge */
        timeout = CAN_TIMEOUT;
        while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout))
        {
            timeout--;
        }

        if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS))
        {
            reval = ERROR;
        } else {
            CAN_BT(can_periph) &= ~BT_MODE(3);
            CAN_BT(can_periph) |= BT_MODE(mode);

            timeout = CAN_TIMEOUT;
            /* enter normal mode */
            CAN_CTL(can_periph) &= ~(uint32_t)(CAN_CTL_SLPWMOD | CAN_CTL_IWMOD);
            /* wait the acknowledge */
            while((0U != (CAN_STAT(can_periph) & (CAN_STAT_IWS | CAN_STAT_SLPWS))) && (0U != timeout))
            {
                timeout--;
            }
            if(0U != (CAN_STAT(can_periph) & (CAN_STAT_IWS | CAN_STAT_SLPWS)))
            {
                reval = ERROR;
            }
        }
    } else {
        reval = ERROR;
    }

    return reval;
}

#ifdef GD32E508
/*!
    \brief      initialize CAN FD function
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[in]  can_fdframe_init: parameters for CAN FD initializtion
      \arg        fd_frame: ENABLE or DISABLE
      \arg        excp_event_detect: ENABLE or DISABLE
      \arg        delay_compensation: ENABLE or DISABLE
      \arg        p_delay_compensation: the pointer of tdc struct
                  can_fd_tdc_struct:
                    tdc_mode: CAN_TDCMOD_CALC_AND_OFFSET or CAN_TDCMOD_OFFSET
                    tdc_filter: 0x00 - 0x07
                    tdc_offset: 0x00 - 0x07
      \arg        iso_bosch: CAN_FDMOD_ISO or CAN_FDMOD_BOSCH
      \arg        esi_mode: CAN_ESIMOD_HARDWARE or CAN_ESIMOD_SOFTWARE
      \arg        data_resync_jump_width: 0x00 - 0x07
      \arg        data_time_segment_1: 0x00 - 0x0F
      \arg        data_time_segment_2: 0x00 - 0x07
      \arg        data_prescaler: 0x0001 - 0x0400
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_fd_init(uint32_t can_periph, can_fdframe_struct *can_fdframe_init)
{
    uint32_t timeout = CAN_TIMEOUT;
    uint32_t tempreg = 0U;

    /* check null pointer */
    if(0 == can_fdframe_init)
    {
        return ERROR;
    }
    /* disable sleep mode */
    CAN_CTL(can_periph) &= ~CAN_CTL_SLPWMOD;
    /* enable initialize mode */
    CAN_CTL(can_periph) |= CAN_CTL_IWMOD;
    /* wait ACK */
    while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout))
    {
        timeout--;
    }
    /* check initialize working success */
    if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS))
    {
        return ERROR;
    } else {
        /* set the data bit timing register */
        CAN_DBT(can_periph) = (BT_DSJW((uint32_t)can_fdframe_init->data_resync_jump_width) | \
                               BT_DBS1((uint32_t)can_fdframe_init->data_time_segment_1) | \
                               BT_DBS2((uint32_t)can_fdframe_init->data_time_segment_2) | \
                               BT_BAUDPSC(((uint32_t)can_fdframe_init->data_prescaler) - 1U));

        tempreg = can_fdframe_init->esi_mode | can_fdframe_init->iso_bosch;

        /* Protocol exception event detection */
        if(ENABLE == can_fdframe_init->excp_event_detect)
        {
            tempreg &= ~CAN_FDCTL_PRED;
        } else {
            tempreg |= CAN_FDCTL_PRED;
        }

        /* Transmitter delay compensation mode */
        if(ENABLE == can_fdframe_init->delay_compensation)
        {
            tempreg |= CAN_FDCTL_TDCEN;
            /* p_delay_compensation pointer should be config when TDC mode is enabled */
            if(0 != can_fdframe_init->p_delay_compensation)
            {
                tempreg |= (can_fdframe_init->p_delay_compensation->tdc_mode & CAN_FDCTL_TDCMOD);
                CAN_FDTDC(can_periph) = (FDTDC_TDCF(can_fdframe_init->p_delay_compensation->tdc_filter) | FDTDC_TDCO(
                                             can_fdframe_init->p_delay_compensation->tdc_offset));
            } else {
                return ERROR;
            }
        } else {
            /* Transmitter delay compensation mode is disabled */
            tempreg &= ~CAN_FDCTL_TDCEN;
        }

        /* FD operation mode */
        if(ENABLE == can_fdframe_init->fd_frame)
        {
            tempreg |= CAN_FDCTL_FDEN;
        } else {
            tempreg &= ~CAN_FDCTL_FDEN;
        }
        CAN_FDCTL(can_periph) = tempreg;

        /* disable initialize mode */
        CAN_CTL(can_periph) &= ~CAN_CTL_IWMOD;
        timeout = CAN_TIMEOUT;
        /* wait the ACK */
        while((CAN_STAT_IWS == (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout))
        {
            timeout--;
        }
        /* check exit initialize mode */
        if(0U == timeout)
        {
            return ERROR;
        }
    }

    return SUCCESS;
}

/*!
    \brief      CAN FD frame function enable
    \param[in]  can_periph
    \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[out] none
    \retval     none
*/
void can_fd_function_enable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) |= CAN_FDCTL_FDEN;
}

/*!
    \brief      CAN FD frame function disable
    \param[in]  can_periph
    \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL
    \param[out] none
    \retval     none
*/
void can_fd_function_disable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) &= ~CAN_FDCTL_FDEN;
}
#endif /* GD32E508 */

/*!
    \brief      set CAN1 fliter start bank number
    \param[in]  start_bank: CAN1 start bank number
                only one parameter can be selected which is shown as below:
      \arg        (1..27)
    \param[out] none
    \retval     none
*/
void can1_filter_start_bank(uint8_t start_bank)
{
    /* filter lock disable */
    CAN_FCTL(CAN0) |= CAN_FCTL_FLD;
    /* set CAN1 filter start number */
    CAN_FCTL(CAN0) &= ~(uint32_t)CAN_FCTL_HBC1F;
    CAN_FCTL(CAN0) |= FCTL_HBC1F(start_bank);
    /* filter lock enable */
    CAN_FCTL(CAN0) &= ~CAN_FCTL_FLD;
}

/*!
    \brief      enable CAN debug freeze
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[out] none
    \retval     none
*/
void can_debug_freeze_enable(uint32_t can_periph)
{
    /* set DFZ bit */
    CAN_CTL(can_periph) |= CAN_CTL_DFZ;
#ifdef GD32E50X_CL
    switch(can_periph)
    {
    case CAN0:
        dbg_periph_enable(DBG_CAN0_HOLD);
        break;
    case CAN1:
        dbg_periph_enable(DBG_CAN1_HOLD);
        break;
    case CAN2:
        dbg_periph_enable(DBG_CAN2_HOLD);
        break;
    default:
        break;
    }
#else
    switch(can_periph)
    {
    case CAN0:
        dbg_periph_enable(DBG_CAN0_HOLD);
        break;
    case CAN1:
        dbg_periph_enable(DBG_CAN1_HOLD);
        break;
    default:
        break;
    }
#endif
}

/*!
    \brief      disable CAN debug freeze
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[out] none
    \retval     none
*/
void can_debug_freeze_disable(uint32_t can_periph)
{
    /* set DFZ bit */
    CAN_CTL(can_periph) &= ~CAN_CTL_DFZ;
#ifdef GD32E50X_CL
    switch(can_periph)
    {
    case CAN0:
        dbg_periph_disable(DBG_CAN0_HOLD);
        break;
    case CAN1:
        dbg_periph_disable(DBG_CAN1_HOLD);
        break;
    case CAN2:
        dbg_periph_disable(DBG_CAN2_HOLD);
        break;
    default:
        break;
#else
    switch(can_periph)
    {
    case CAN0:
        dbg_periph_disable(DBG_CAN0_HOLD);
        break;
    case CAN1:
        dbg_periph_disable(DBG_CAN1_HOLD);
        break;
    default:
        break;
#endif
    }
}

/*!
    \brief      enable CAN time trigger mode
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_enable(uint32_t can_periph)
{
    uint8_t mailbox_number;

    /* enable the tcc mode */
    CAN_CTL(can_periph) |= CAN_CTL_TTC;
    /* enable time stamp */
    for(mailbox_number = 0U; mailbox_number < 3U; mailbox_number++)
    {
        CAN_TMP(can_periph, mailbox_number) |= CAN_TMP_TSEN;
    }
}

/*!
    \brief      disable CAN time trigger mode
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E50X_CL and GD32E508
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_disable(uint32_t can_periph)
{
    uint8_t mailbox_number;

